Revit 2027 API
FluidType.GetFluidTemperatureSetIterator Method
Returns a FluidTemperatureSetIterator that iterates through the collection.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FluidTemperatureSetIterator GetFluidTemperatureSetIterator()
Public Function GetFluidTemperatureSetIterator As FluidTemperatureSetIterator
public:
FluidTemperatureSetIterator^ GetFluidTemperatureSetIterator()
member GetFluidTemperatureSetIterator : unit -> FluidTemperatureSetIterator
Return Value
FluidTemperatureSetIterator
A FluidTemperatureSetIterator object that can be used to iterate through key-value pairs in the collection.
See Also
Reference
FluidType Class
Autodesk.Revit.DB.Plumbing Namespace